export const colors = {
    black: '#000000',
    white: '#FFFFFF',
    pink: '#F43EB4',
    inputBorder: '#EDEDED', // + toggle 배경 (피그마 - 이메일 인증 부분) + 태그 배경 -> gray 600
    default: '#615FFF',
    defaultHover: '#4F39F6',
    disabled: '#D4D4D4',
    textHelper: '#858585',
    progressBarBackground: '#DBE0E5', // progress bar 배경
    red: {
        100: '#FFEEEE',
        200: '#FFDDDD',
        300: '#FFCCCC',
        400: '#FFBBBB',
        500: '#FFAAAA', //
        600: '#FF8888',
        700: '#FD6363',
        800: '#F13B3E', //
        900: '#FF2222',
        1000: '#FF0000', //
        1100: '#EB3223',
        1200: '#D80000', //
        1300: '#9B0305',
    },
    gray: {
        100: '#F8F8F8',
        200: '#F6F7FA', // 서류평가 - 지원자 리스트 - 검색바 배경
        300: '#F5F5F5',
        400: '#F2F2F6', // 모집공고 tab, 프로세스 박스
        500: '#EEEEEE', // 서류평가 - 지원자 리스트 - 사용자 클릭 시
        600: '#EDEDED', // 태그 배경
        700: '#D9D9D9', // Rating - 별 (비활성화)
        800: '#CECECE', // 구분선
        900: '#CBCBCB', // 스크롤바
        1000: '#C4C4C4', // 동아리 모집 카드 - 구분선
        1100: '#C2C2C2', // 사전 질문 input 밑줄
        1200: '#BABABA',
        1300: '#B2B2B2', // 사전 질문 border
        1400: '#AFAFAF', // 동아리 모집 카드 - 동아리 대분류
        1500: '#A6A6A6', // 동아리 지원 서류 페이지 - 지원메뉴 - 글자 (비활성화)
        1600: '#A0A0A0', // 동아리 모집카드 - 캘린더 아이콘 svg
        1700: '#999999', // 사이드바 - 글자 색
        1800: '#979797', // 동아리 지원 서류 페이지 - 동아리 대분류
        1900: '#8D8D8D', // 자기소개서 부분 칸
        2000: '#888888', //
        2100: '#818181', // 모집공고 - 기본 정보 컨테이너
        2200: '#777777', // 검색 아이콘
        2300: '#666666', // 사이드바 - 동아리 전환 버튼
        2400: '#444444',
        2500: '#333333', // 사이드바 - 글자 색
    },
    blue: {
        100: '#E2E7FF',
        200: '#8599FF',
        300: '#637AFD',
    },
    green: {
        100: '#BCD65B',
        200: '#2CB602',
        300: '#01691C',
    },
    brown: {
        100: '#694301',
    },
};
